In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [3]:
c.execute('''SELECT COUNT(author)
             FROM author''')
c.fetchall()

[(100000,)]

In [6]:
c.execute('''SELECT COUNT(DISTINCT(author))
             FROM author
             WHERE author LIKE "David%"''')
c.fetchall()

[(1024,)]

In [12]:
c.execute("""SELECT author, COUNT(book) as num_of_books
             FROM author
             GROUP BY author
             ORDER BY num_of_books DESC
             LIMIT 10
             """)
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

            author  num_of_books
0  Robert Williams            25
1      James Smith            24
2    William Smith            22
3   Robert Johnson            21
4    Mary Williams            19
5    Michael Smith            19
6     John Johnson            18
7    John Williams            18
8      James Brown            17
9       John Smith            17

In [20]:
c.execute('''SELECT author, SUM(num_copies) as total_copies
             FROM books b
             JOIN author a
             ON b.books = a.book
             WHERE author LIKE 'David%'
             GROUP BY author''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

           author  total_copies
0    David Abbott        828701
1    David Aberle       3376038
2  David Abramson        696103
3   David Acevedo       1211907
4     David Adams       4804120

In [21]:
c.execute('''SELECT SUM(num_copies) as total_david_sales
             FROM author a
             JOIN books b
             ON b.books = a.book
             WHERE author LIKE "David%"''')
c.fetchall()

[(2611352486,)]